___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">DA & DVwPY</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">The Exploratory Data Analysis (EDA) Project</p>

<img src=https://i.ibb.co/wJW61Y2/Used-cars.jpg width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">AutoScout Car Price Prediction EDA</p>

## Introduction
Welcome to "***AutoScout Exploratory Data Analysis (EDA) Project***". This is the project of completing ***Data Analysis & Data Visualization*** Courses and a successful hand-over is mandatory for getting certification for both courses. **Auto Scout** data used in this project scraped from the Website of an online car trading company in 2022, and contains many features of 13 different car makes including 594 models. In this project, you will have the opportunity to apply many commonly used algorithms for Data Cleaning and Exploratory Data Analysis by using a variety of Python libraries, such as Numpy, Pandas, Matplotlib, Seaborn, Scipy, and then you will get a clean dataset for your analysis and pretictive modelling in Machine Learning Path. So you will have the chance to use all the skills you have already learned in the Data Analysis and Visualization courses.

**``In this context, the project consists of 3 parts in general:``**
* **The first part** is related to ``'Data Cleaning'``. It deals with Incorrect Headers, Incorrect Format, Anomalies, and Dropping useless columns.
* **The second part** is related to ``'Filling Data'``, in other words 'Imputation'. It deals with Missing Values. Categorical to numeric transformation, Encoding, is done as well.
* **The third part** is related to ``'Handling Outliers of Data'`` via Visualization libraries. So, some insights will be extracted.

**``SPECIAL NOTE:``**  However, you are ``free to create your own style``. You do ``NOT`` have to stick to the steps above. Nevertheless, we, the DA & DV instructors, recommend you study each part separately to create a source notebook for your further studies. 

In order to build your Portfolio in terms of the GitHub account, you need to push your solution file up to your own repository.

Please after solving the task, commit your notebook to GitHub and submit its link to LMS page where the project is settled down.

**BE NOTED:** Please ``DO NOT FORGET`` to click the submit button.

### Some Reminders on Exploratory data analysis (EDA)

Exploratory data analysis (EDA) is an especially important activity in the routine of a data analyst or scientist. It enables an in depth understanding of the dataset, define or discard hypotheses and create predictive models on a solid basis. It uses data manipulation techniques and several statistical tools to describe and understand the relationship between variables and how these can impact business. By means of EDA, we can obtain meaningful insights that can impact analysis under the following questions (If a checklist is good enough for pilots to use every flight, it’s good enough for data scientists to use with every dataset).
1. What question are you trying to solve (or prove wrong)?
2. What kind of data do you have?
3. What’s missing from the data?
4. Where are the outliers?
5. How can you add, change or remove features to get more out of your data?

**``Exploratory data analysis (EDA)``** is often an **iterative brainstorming process** where you pose a question, review the data, and develop further questions to investigate before beginning model development work. The image below shows how the brainstorming phase is connected with that of understanding the variables and how this in turn is connected again with the brainstorming phase.<br>

<img src=https://i.ibb.co/k0MC950/EDA-Process.png width="300" height="100">

[Image Credit: Andrew D.](https://towardsdatascience.com/exploratory-data-analysis-in-python-a-step-by-step-process-d0dfa6bf94ee)

# PART- 1 `( Data Cleaning )`

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
pd.options.display.float_format = '{:,.2f}'.format

In [9]:
# skimpy - 컬럼이름 한번에 클리닝 해줌

from skimpy import clean_columns

In [3]:
print(np.__version__)

1.24.3

In [4]:
import re
pd.set_option('display.max_rows', 10)

In [5]:
# pip install skimpy

# Import Data

In [6]:
df0 = pd.read_json("as24_cars.zip")

In [7]:
# 컬럼과 데이터가 얼마나 있는지 알아본다
df0.shape

(29480, 58)

In [8]:
# 데이터 타입을 확인해준다.
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29480 entries, 0 to 29479
Data columns (total 58 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   make_model                28630 non-null  object
 1   short_description         28630 non-null  object
 2   make                      28630 non-null  object
 3   model                     28630 non-null  object
 4   location                  28630 non-null  object
 5   price                     28630 non-null  object
 6   Body type                 28630 non-null  object
 7   Type                      28630 non-null  object
 8   Doors                     28271 non-null  object
 9   Country version           16889 non-null  object
 10  Offer number              23100 non-null  object
 11  Warranty                  15784 non-null  object
 12  Mileage                   28629 non-null  object
 13  First registration        28628 non-null  object
 14  Gearbox                   28382 non-null  object
 15  Fuel type                 26843 non-null  object
 16  Colour                    26906 non-null  object
 17  Paint                     14495 non-null  object
 18  desc                      28047 non-null  object
 19  seller                    28630 non-null  object
 20  Seats                     25505 non-null  object
 21  Power                     28058 non-null  object
 22  Engine size               27227 non-null  object
 23  Gears                     18954 non-null  object
 24  CO₂-emissions             18594 non-null  object
 25  Manufacturer colour       21787 non-null  object
 26  Drivetrain                16893 non-null  object
 27  Cylinders                 18852 non-null  object
 28  Fuel consumption          23385 non-null  object
 29
Comfort & Convenience
   25433 non-null  object
 30
Entertainment & Media
   23644 non-null  object
 31
Safety & Security
       25415 non-null  object
 32
Extras
                  23480 non-null  object
 33  Empty weight              17758 non-null  object
 34  Model code                8367 non-null   object
 35  General inspection        12254 non-null  object
 36  Last service              2003 non-null   object
 37  Full service history      12565 non-null  object
 38  Non-smoker vehicle        11594 non-null  object
 39  Emission class            17859 non-null  object
 40  Emissions sticker         9414 non-null   object
 41  Upholstery colour         14569 non-null  object
 42  Upholstery                18610 non-null  object
 43  Production date           5908 non-null   float64
 44  Previous owner            14015 non-null  object
 45  Other fuel types          2313 non-null   object
 46  Power consumption         515 non-null    object
 47  Energy efficiency class   7804 non-null   object
 48  CO₂-efficiency            7804 non-null   object
 49  Fuel consumption (WLTP)   100 non-null    object
 50  CO₂-emissions (WLTP)      116 non-null    object
 51  Available from            393 non-null    object
 52  Taxi or rental car        422 non-null    object
 53  Availability              301 non-null    object
 54  Last timing belt change   572 non-null    object
 55  Electric Range (WLTP)     16 non-null     object
 56  Power consumption (WLTP)  16 non-null     object
 57  Battery Ownership         7 non-null      object
dtypes: float64(1), object(57)
memory usage: 13.0+ MB

In [ ]:
# 숫자로(numerical value) 데이터만 뽑아서 five값을 출력해준다.

df0.describe()

In [11]:
df0 = clean_columns(df0)
df0.info()

0 column names have been cleaned

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29480 entries, 0 to 29479
Data columns (total 58 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   make_model               28630 non-null  object
 1   short_description        28630 non-null  object
 2   make                     28630 non-null  object
 3   model                    28630 non-null  object
 4   location                 28630 non-null  object
 5   price                    28630 non-null  object
 6   body_type                28630 non-null  object
 7   type                     28630 non-null  object
 8   doors                    28271 non-null  object
 9   country_version          16889 non-null  object
 10  offer_number             23100 non-null  object
 11  warranty                 15784 non-null  object
 12  mileage                  28629 non-null  object
 13  first_registration       28628 non-null  object
 14  gearbox                  28382 non-null  object
 15  fuel_type                26843 non-null  object
 16  colour                   26906 non-null  object
 17  paint                    14495 non-null  object
 18  desc                     28047 non-null  object
 19  seller                   28630 non-null  object
 20  seats                    25505 non-null  object
 21  power                    28058 non-null  object
 22  engine_size              27227 non-null  object
 23  gears                    18954 non-null  object
 24  co_emissions             18594 non-null  object
 25  manufacturer_colour      21787 non-null  object
 26  drivetrain               16893 non-null  object
 27  cylinders                18852 non-null  object
 28  fuel_consumption         23385 non-null  object
 29  comfort_&_convenience    25433 non-null  object
 30  entertainment_&_media    23644 non-null  object
 31  safety_&_security        25415 non-null  object
 32  extras                   23480 non-null  object
 33  empty_weight             17758 non-null  object
 34  model_code               8367 non-null   object
 35  general_inspection       12254 non-null  object
 36  last_service             2003 non-null   object
 37  full_service_history     12565 non-null  object
 38  non_smoker_vehicle       11594 non-null  object
 39  emission_class           17859 non-null  object
 40  emissions_sticker        9414 non-null   object
 41  upholstery_colour        14569 non-null  object
 42  upholstery               18610 non-null  object
 43  production_date          5908 non-null   float64
 44  previous_owner           14015 non-null  object
 45  other_fuel_types         2313 non-null   object
 46  power_consumption        515 non-null    object
 47  energy_efficiency_class  7804 non-null   object
 48  co_efficiency            7804 non-null   object
 49  fuel_consumption_wltp    100 non-null    object
 50  co_emissions_wltp        116 non-null    object
 51  available_from           393 non-null    object
 52  taxi_or_rental_car       422 non-null    object
 53  availability             301 non-null    object
 54  last_timing_belt_change  572 non-null    object
 55  electric_range_wltp      16 non-null     object
 56  power_consumption_wltp   16 non-null     object
 57  battery_ownership        7 non-null      object
dtypes: float64(1), object(57)
memory usage: 13.0+ MB

In [12]:
# 데이터 컬럼명들 확인
df0.columns

Index(['make_model', 'short_description', 'make', 'model', 'location', 'price',
       'body_type', 'type', 'doors', 'country_version', 'offer_number',
       'warranty', 'mileage', 'first_registration', 'gearbox', 'fuel_type',
       'colour', 'paint', 'desc', 'seller', 'seats', 'power', 'engine_size',
       'gears', 'co_emissions', 'manufacturer_colour', 'drivetrain',
       'cylinders', 'fuel_consumption', 'comfort_&_convenience',
       'entertainment_&_media', 'safety_&_security', 'extras', 'empty_weight',
       'model_code', 'general_inspection', 'last_service',
       'full_service_history', 'non_smoker_vehicle', 'emission_class',
       'emissions_sticker', 'upholstery_colour', 'upholstery',
       'production_date', 'previous_owner', 'other_fuel_types',
       'power_consumption', 'energy_efficiency_class', 'co_efficiency',
       'fuel_consumption_wltp', 'co_emissions_wltp', 'available_from',
       'taxi_or_rental_car', 'availability', 'last_timing_belt_change',
       'electric_range_wltp', 'power_consumption_wltp', 'battery_ownership'],
      dtype='object')

# The Examination of Missing Values

In [13]:
# missing value 찾기 (False- 데이터 있음, True- 데이터 없음)
df0.isnull().sum()

make_model                   850
short_description            850
make                         850
model                        850
location                     850
                           ...
availability               29179
last_timing_belt_change    28908
electric_range_wltp        29464
power_consumption_wltp     29464
battery_ownership          29473
Length: 58, dtype: int64

In [16]:
# Percentage of missing values

df0.isnull().sum()*100 / df0.shape[0]

make_model                 2.88
short_description          2.88
make                       2.88
model                      2.88
location                   2.88
                           ...
availability              98.98
last_timing_belt_change   98.06
electric_range_wltp       99.95
power_consumption_wltp    99.95
battery_ownership         99.98
Length: 58, dtype: float64


### *Droping columns that have missing values more than %80.*

In [19]:
def df_nans(df0, limit):
    missing = df0.isnull().sum()*100 / df0.shape[0]
    missing = missing.loc[lambda x : x >= limit]
    if missing.empty:
        return "No columns have missing values that exceed the given limit."
    else:
        return missing

def show_missing_values(limit):
    return df_nans(df0, limit)

def column_nans(serial):
    # display percentage of nans in a Series
    return serial.isnull().sum()*100 / serial.shape[0]

In [20]:
# missing value 가 80% 넘는 columns 찾기.

drop_columns = df_nans(df0, 80).index
drop_columns

Index(['last_service', 'other_fuel_types', 'power_consumption',
       'fuel_consumption_wltp', 'co_emissions_wltp', 'available_from',
       'taxi_or_rental_car', 'availability', 'last_timing_belt_change',
       'electric_range_wltp', 'power_consumption_wltp', 'battery_ownership'],
      dtype='object')

In [22]:
display(df0.shape)
df0.drop(drop_columns, axis=1, inplace=True)
display(df0.shape)

(29480, 58)

(29480, 46)

In [23]:
# RangeIndex- 숫자가 매칭되는지 확인.
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29480 entries, 0 to 29479
Data columns (total 46 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   make_model               28630 non-null  object
 1   short_description        28630 non-null  object
 2   make                     28630 non-null  object
 3   model                    28630 non-null  object
 4   location                 28630 non-null  object
 5   price                    28630 non-null  object
 6   body_type                28630 non-null  object
 7   type                     28630 non-null  object
 8   doors                    28271 non-null  object
 9   country_version          16889 non-null  object
 10  offer_number             23100 non-null  object
 11  warranty                 15784 non-null  object
 12  mileage                  28629 non-null  object
 13  first_registration       28628 non-null  object
 14  gearbox                  28382 non-null  object
 15  fuel_type                26843 non-null  object
 16  colour                   26906 non-null  object
 17  paint                    14495 non-null  object
 18  desc                     28047 non-null  object
 19  seller                   28630 non-null  object
 20  seats                    25505 non-null  object
 21  power                    28058 non-null  object
 22  engine_size              27227 non-null  object
 23  gears                    18954 non-null  object
 24  co_emissions             18594 non-null  object
 25  manufacturer_colour      21787 non-null  object
 26  drivetrain               16893 non-null  object
 27  cylinders                18852 non-null  object
 28  fuel_consumption         23385 non-null  object
 29  comfort_&_convenience    25433 non-null  object
 30  entertainment_&_media    23644 non-null  object
 31  safety_&_security        25415 non-null  object
 32  extras                   23480 non-null  object
 33  empty_weight             17758 non-null  object
 34  model_code               8367 non-null   object
 35  general_inspection       12254 non-null  object
 36  full_service_history     12565 non-null  object
 37  non_smoker_vehicle       11594 non-null  object
 38  emission_class           17859 non-null  object
 39  emissions_sticker        9414 non-null   object
 40  upholstery_colour        14569 non-null  object
 41  upholstery               18610 non-null  object
 42  production_date          5908 non-null   float64
 43  previous_owner           14015 non-null  object
 44  energy_efficiency_class  7804 non-null   object
 45  co_efficiency            7804 non-null   object
dtypes: float64(1), object(45)
memory usage: 10.3+ MB

In [ ]:
#### 중요 #####
# 모든 컬럼이 아무런 벨류를 가지지 않고 있으면 드롭한다
# df.dropna(how='all'...?)

# The Examination of Duplicated Values

In [25]:
# df0.duplicated() :
# This code gives TypeError: unhashable type: 'list'

df0.astype(str).duplicated(keep=False).sum()

4384

In [27]:
# 직접 중복 데이터 확인하기
df0[df0.astype(str).duplicated(keep=False)]

,make_model,short_description,make,model,location,price,body_type,type,doors,country_version,...,full_service_history,non_smoker_vehicle,emission_class,emissions_sticker,upholstery_colour,upholstery,production_date,previous_owner,energy_efficiency_class,co_efficiency
579,Mercedes-Benz SLK 200,Kompressor Aut. Cabrio Final Edition,\nMercedes-Benz\n,"[\n, SLK 200 ,\n]","Marienborner Str. 49, 55128 Mainz, DE","€ 15,990.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Germany, \n]",...,NaN,Yes,Euro 4,4 (Green),Black,Full leather,NaN,"[[39,000 km, 05/2003], 1]",NaN,NaN
580,Mercedes-Benz SLK 200,Kompressor Aut. Cabrio Final Edition,\nMercedes-Benz\n,"[\n, SLK 200 ,\n]","Marienborner Str. 49, 55128 Mainz, DE","€ 15,990.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Germany, \n]",...,NaN,Yes,Euro 4,4 (Green),Black,Full leather,NaN,"[[39,000 km, 05/2003], 1]",NaN,NaN
610,Mercedes-Benz G 500,Cabrio LORINSER UMBAU/AHK/ELEKTR. SITZE,\nMercedes-Benz\n,"[\n, G 500 ,\n]","Alte Bundesstr. 45, 71332 Waiblingen, DE","€ 209,000.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 3, \n]",NaN,...,Yes,Yes,Euro 4,4 (Green),Black,Full leather,"1,999.00","[[172,000 km, 02/1999], 2]",G,Calculated on basis of measured CO₂-emissions ...
613,Mercedes-Benz G 500,Cabrio LORINSER UMBAU/AHK/ELEKTR. SITZE,\nMercedes-Benz\n,"[\n, G 500 ,\n]","Alte Bundesstr. 45, 71332 Waiblingen, DE","€ 209,000.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 3, \n]",NaN,...,Yes,Yes,Euro 4,4 (Green),Black,Full leather,"1,999.00","[[172,000 km, 02/1999], 2]",G,Calculated on basis of measured CO₂-emissions ...
839,Mercedes-Benz CLA 45 AMG,4Matic*KAMERA*NAVI*LED*DESIGNO*SHZ*,\nMercedes-Benz\n,"[\n, CLA 45 AMG ,\n]","Aidlinger Straße 16 - 18, 71069 Sindelfingen-...","€ 33,890.-","[\n, Coupe, \n]","[\n, Used, \n]","[\n, 4, \n]","[\n, Germany, \n]",...,Yes,Yes,Euro 6,4 (Green),Black,alcantara,NaN,"[[76,900 km, 08/2016], 2]",NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29441,Volvo V40,D3 150ch R-Design Geartronic,\nVolvo\n,"[\n, V40 ,\n]","19 rue des Alliés, 57050 Metz, FR","€ 18,999.-","[\n, Sedan, \n]","[\n, Used, \n]","[\n, 5, \n]",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29445,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29451,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29473,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29479,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
df0[df0.astype(str).duplicated(['make_model', 'short_description', 'location'], keep=False)]['make_model'].value_counts(dropna=True)

Volvo C70              690
Volvo V40              678
Volvo XC60             350
Volvo V60              308
Volvo C30              228
                      ...
Mercedes-Benz V 250      2
Toyota Camry             2
Toyota Avensis           2
Mercedes-Benz S 500      2
Volvo 945                2
Name: make_model, Length: 198, dtype: int64

In [29]:
# make_model 컬럼의 중복데이터 확인 및 제거

df0[df0.astype(str)['make_model'] == 'Volvo C70']

,make_model,short_description,make,model,location,price,body_type,type,doors,country_version,...,full_service_history,non_smoker_vehicle,emission_class,emissions_sticker,upholstery_colour,upholstery,production_date,previous_owner,energy_efficiency_class,co_efficiency
26470,Volvo C70,T5 Summum,\nVolvo\n,"[\n, C70 ,\n]","RIO ULLA 15, 28017 MADRID, ES","€ 11,999.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Spain, \n]",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26471,Volvo C70,2.4i Momentum,\nVolvo\n,"[\n, C70 ,\n]","Auf dem Sand 28, 40721 Hilden, DE","€ 11,880.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Germany, \n]",...,Yes,NaN,Euro 4,4 (Green),Beige,Part leather,NaN,"[[155,923 km, 08/2006], 2]",F,Calculated on basis of measured CO₂-emissions ...
26472,Volvo C70,2.5T 220PS Cabriolet T5 Summum 1.Hand Xenon,\nVolvo\n,"[\n, C70 ,\n]","Lichterfelder Allee 14, 14513 Teltow, DE","€ 20,999.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Germany, \n]",...,Yes,Yes,Euro 4,4 (Green),Grey,Full leather,NaN,"[[69,747 km, 05/2007], 1]",NaN,NaN
26473,Volvo C70,2.0 D3 150PS Cabriolet Momentum Automatik,\nVolvo\n,"[\n, C70 ,\n]","Lichterfelder Allee 14, 14513 Teltow, DE","€ 14,999.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Germany, \n]",...,Yes,Yes,Euro 5,4 (Green),Black,Part leather,NaN,"[[146,348 km, 10/2011], 1]",NaN,NaN
26474,Volvo C70,2.0D SUMMUM,\nVolvo\n,"[\n, C70 ,\n]",POL. IND. DE CROSS 39600 SANTANDER CANTABRIA E...,"€ 9,900.-","[\n, Convertible, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Spain, \n]",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27449,Volvo C70,C70 Coupe 2.5 193cv,\nVolvo\n,"[\n, C70 ,\n]","47923 Rimini, IT","€ 7,400.-","[\n, Coupe, \n]","[\n, Used, \n]","[\n, 2, \n]",NaN,...,NaN,Yes,Euro 6,NaN,Grey,Full leather,NaN,NaN,NaN,NaN
27450,Volvo C70,Coupé 2.0 T Prestige UNIEK!,\nVolvo\n,"[\n, C70 ,\n]","Edisonweg 16a, 2952 AD ALBLASSERDAM, NL","€ 8,950.-","[\n, Coupe, \n]","[\n, Used, \n]","[\n, 2, \n]",NaN,...,Yes,NaN,NaN,NaN,Other,Full leather,NaN,"[[118,232 km, 12/2000], 2]",NaN,NaN
27451,Volvo C70,COUPE' 2000 TURBO T5 226CV,\nVolvo\n,"[\n, C70 ,\n]","41126 Modena, IT","€ 7,500.-","[\n, Coupe, \n]","[\n, Used, \n]","[\n, 2, \n]",NaN,...,Yes,Yes,Euro 3,NaN,Black,Full leather,NaN,"[[227,000 km, 02/2000], 1]",NaN,NaN
27456,Volvo C70,2.5T,\nVolvo\n,"[\n, C70 ,\n]","94051 Hauzenberg, DE","€ 12,500.-","[\n, Coupe, \n]","[\n, Used, \n]","[\n, 2, \n]",NaN,...,Yes,Yes,Euro 3,1 (No sticker),Beige,Full leather,NaN,"[[182,000 km, 11/1998], 1]",NaN,NaN
27486,Volvo C70,2.0 D Summum,\nVolvo\n,"[\n, C70 ,\n]","Viale della Marina, 59, 00122 Ostia lido - Ro...","€ 9,900.-","[\n, Coupe, \n]","[\n, Used, \n]","[\n, 2, \n]","[\n, Italy, \n]",...,NaN,NaN,Euro 4,NaN,Black,Full leather,NaN,"[[195,000 km, 07/2008], 2]",NaN,NaN

In [30]:
df0[df0['make_model'] == 'Volvo C70'].astype(str).duplicated(keep=False).value_counts(dropna=False)

True     690
False      2
dtype: int64

## <p style="background-color:#7d5f9c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">데이터 추출</p>

In [68]:
# Let's remember our User Defined Function for first looking to the columns

def first_looking(col):
    print("column name    : ", col)  # Prints out related column name
    print("--------------------------------")
    print("per_of_nulls   : ", "%", round(df0[col].isnull().sum()*100 / df0.shape[0], 2))  # Calculates the percentage of Null values for related column
    print("num_of_nulls   : ", df0[col].isnull().sum())  # Prints out the total number of Null values for related column
    print("num_of_uniques : ", df0[col].astype(str).nunique())  # Prints out the number of unique values for related column
    print("shape_of_df    : ", df0.shape)
    print("--------------------------------")
    print(df0[col].value_counts(dropna = False))  # Prints out the number of occurance for unique values in the related column

In [69]:
first_looking('make_model')

column name    :  make_model
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  611
shape_of_df    :  (28630, 45)
--------------------------------
Renault Megane     863
SEAT Leon          787
Volvo V40          740
Dacia Sandero      730
Hyundai i30        706
                  ...
Toyota GR86          1
Toyota Tacoma        1
Toyota Tundra        1
Toyota 4-Runner      1
Volvo 244            1
Name: make_model, Length: 611, dtype: int64

## short_description | column

In [64]:
first_looking('short_description')

column name    :  short_description
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  20947
--------------------------------
                                                      213
D2 Momentum 120                                        88
D2 Kinetic 120                                         87
Cabrio 1.4T S&S Excellence                             85
Extreme+ 7-Sitzer TCe 110                              57
                                                     ...
PureTech  EAT8 Allure Pack...DISP. PER NOLEGGIO         1
BlueHDi 130 S&S EAT8 Business                           1
2.0 BlueHDi 180ch S\u0026S GT Line EAT8                 1
1.2 PureTech Première AUT. NAVI PANO                    1
2.9 Executive G. NETTE AUTO! LEER! NAVI! CRUISE! L      1
Name: short_description, Length: 20947, dtype: int64

### Make Drop_columns columns

In [ ]:
def drop_columns(col):
    return df0.drop(columns = col, inplace = True)

In [ ]:
# 여기서 해도 되고 나중에 한번에 제거해도 됨.

# drop_columns('short_description')

## make | column

In [47]:
first_looking('make')

column name    :  make
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  13
--------------------------------
\nVolvo\n            3659
\nMercedes-Benz\n    2398
\nOpel\n             2385
\nPeugeot\n          2360
\nRenault\n          2351
                     ...
\nToyota\n           2038
\nHyundai\n          1867
\nSEAT\n             1743
\nSkoda\n            1566
\nDacia\n            1537
Name: make, Length: 13, dtype: int64

In [48]:
# df0['make']

df0['make'] = df0['make'].str.strip()
df0['make'].sample(10)

11458             Fiat
20252           Nissan
27821            Volvo
18585           Toyota
7007           Renault
592      Mercedes-Benz
26898            Volvo
18965           Toyota
2681              Opel
18198           Toyota
Name: make, dtype: object

In [49]:
df0.make.value_counts(dropna=False)

Volvo            3659
Mercedes-Benz    2398
Opel             2385
Peugeot          2360
Renault          2351
                 ...
Toyota           2038
Hyundai          1867
SEAT             1743
Skoda            1566
Dacia            1537
Name: make, Length: 13, dtype: int64

## model | column

In [50]:
first_looking('model')

column name    :  model
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  594
--------------------------------
[\n, Megane ,\n]        863
[\n, Leon ,\n]          787
[\n, V40 ,\n]           740
[\n, Sandero ,\n]       730
[\n, i30 ,\n]           706
                       ...
[\n, GLA 35 AMG ,\n]      1
[\n, G 55 AMG ,\n]        1
[\n, Ariya ,\n]           1
[\n, 105 ,\n]             1
[\n, 244 ,\n]             1
Name: model, Length: 594, dtype: int64

In [51]:
## 더쉬운방법으로 가운데만 픽업하기
# explode() - 리스트안에있는 요소들만 가져오기
df0['model'].explode()

0           \n, A 160 ,\n
1         \n, EQE 350 ,\n
2        \n, A 45 AMG ,\n
3        \n, A 35 AMG ,\n
4        \n, A 45 AMG ,\n
               ...
29474         \n, S90 ,\n
29475         \n, S40 ,\n
29476         \n, C30 ,\n
29477         \n, S90 ,\n
29478         \n, S80 ,\n
Name: model, Length: 28630, dtype: object

In [52]:
df0['model'].explode().str.strip('\n, ')

0           A 160
1         EQE 350
2        A 45 AMG
3        A 35 AMG
4        A 45 AMG
           ...
29474         S90
29475         S40
29476         C30
29477         S90
29478         S80
Name: model, Length: 28630, dtype: object

In [53]:
df0['model'] = df0['model'].explode().str.strip('\n, ')
df0['model']

0           A 160
1         EQE 350
2        A 45 AMG
3        A 35 AMG
4        A 45 AMG
           ...
29474         S90
29475         S40
29476         C30
29477         S90
29478         S80
Name: model, Length: 28630, dtype: object

In [54]:
df0.model.value_counts(dropna=False)

Megane        863
Leon          787
V40           740
Sandero       730
i30           706
             ...
GLA 35 AMG      1
G 55 AMG        1
Ariya           1
105             1
244             1
Name: model, Length: 594, dtype: int64

**Let's check the compatibility of the values in the ``make`` and ``model`` columns of the vehicles with the values in the ``make_model`` column:**

In [55]:
df0[['make_model', 'make', 'model']].sample(20)

                   make_model           make            model
9939                 Fiat 500           Fiat              500
4169         Opel Zafira Life           Opel      Zafira Life
2995                    Opel            Opel
18149            Toyota RAV 4         Toyota            RAV 4
6384         Renault Talisman        Renault         Talisman
...                       ...            ...              ...
26475               Volvo C70          Volvo              C70
122    Mercedes-Benz A 45 AMG  Mercedes-Benz         A 45 AMG
18008            Toyota RAV 4         Toyota            RAV 4
14076   Skoda Rapid/Spaceback          Skoda  Rapid/Spaceback
8224              Peugeot RCZ        Peugeot              RCZ

[20 rows x 3 columns]

In [56]:
# model 이 Null or missing value

display(df0.loc[2995, "model"])
display(df0.loc[2967, "model"])
display(df0.loc[22043, "model"])

''

''

''

In [57]:
df0['model'].str.contains(r'^\s*$').value_counts()

False    28354
True       276
Name: model, dtype: int64

In [58]:
display((df0[df0['model'].str.contains(r'^\s*$')][ "model"]).count())
df0[df0['model'].str.contains(r'^\s*$')][["make_model", "make", "model"]]

276

           make_model           make model
162    Mercedes-Benz   Mercedes-Benz
184    Mercedes-Benz   Mercedes-Benz
186    Mercedes-Benz   Mercedes-Benz
211    Mercedes-Benz   Mercedes-Benz
213    Mercedes-Benz   Mercedes-Benz
...               ...            ...   ...
27638          Volvo           Volvo
27681          Volvo           Volvo
28020          Volvo           Volvo
28036          Volvo           Volvo
28079          Volvo           Volvo

[276 rows x 3 columns]

**Let's check how many unique values there have been for ``make_model``, ``make``, and ``model``:**

In [59]:
display(df0["make_model"].nunique())  # The number of unique values in "make_model"
display(df0["make"].nunique())  # The number of unique values in "make"
display(df0["model"].nunique())  # The number of unique values in "model"

display(df0.groupby("make")["model"].nunique().to_frame())
# display(df[df['make_model'].str.contains(r'Dacia')]["model"].nunique())
# display(df[df['make_model'].str.contains(r'Fiat')]["model"].nunique())
# display(df[df['make_model'].str.contains(r'SEAT')]["model"].nunique())

611

13

594

               model
make
Dacia              9
Fiat              45
Ford              44
Hyundai           35
Mercedes-Benz    205
...              ...
Renault           45
SEAT              16
Skoda             14
Toyota            39
Volvo             34

[13 rows x 1 columns]

In [61]:
df0.shape

(28630, 46)

**After the examination, we will keep the columns of "make_model", "make", and "model" and decide later which one/s will be dropped.**

In [62]:
# make user-define function for picking

def picker(col):
   return df0[col].apply(lambda x: x[0].split(',')[1] if type(x)==list else np.nan)

In [63]:
# with explode user-define function

def picker_explode(col):
    return df0[col].explode().str.strip('\n, ')

In [ ]:
df0.head(10)

## price | columns - 가장 중요한 파트

In [32]:
first_looking('price')

column name    :  price
--------------------------------
per_of_nulls   :  % 2.88
num_of_nulls   :  850
num_of_uniques :  5022
--------------------------------
NaN           850
€ 14,990.-    222
€ 12,990.-    219
€ 16,990.-    186
€ 19,990.-    166
             ...
€ 19,112.-      1
€ 30,465.-      1
€ 18,461.-      1
€ 22,649.-      1
€ 4,440.-       1
Name: price, Length: 5022, dtype: int64

In [34]:
# 가격파트에 Null value 가 있는것은 비이상적. 확인 필수.

df0['price'].isnull().any()

True

In [35]:
display(df0[df0["price"].isnull()].sample(20))
price_nans = df0["price"].isnull().sum()
print(f"Price feature/column has {price_nans} NaN values.")

,make_model,short_description,make,model,location,price,body_type,type,doors,country_version,...,full_service_history,non_smoker_vehicle,emission_class,emissions_sticker,upholstery_colour,upholstery,production_date,previous_owner,energy_efficiency_class,co_efficiency
12284,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10752,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23807,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29451,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20428,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13641,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27133,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21867,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18904,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21663,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Price feature/column has 850 NaN values.

In [36]:
def clean_currency(x):
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """
    """스트링 벨류만 확인하여 유로사인과 코마를 없앤후 출력"""
    if isinstance(x, str):
        return(x.replace('€', '').replace(',', '').replace('-',''))
    return(x)

In [ ]:
# df['price'].explode().str.strip("€, .-").str.replace(",", "")

In [ ]:
# df['price'] = df['price'].astype(str).str.extract('(\d+.\d+)')
# df['price'] = df['price'].str.replace(",", "").astype(float)
# df['price']

In [37]:
df0['price'].apply(type).value_counts()

<class 'str'>      28630
<class 'float'>      850
Name: price, dtype: int64

In [38]:
df0['price'] = df0['price'].apply(clean_currency).astype('float')
df0['price']

0       16,950.00
1       80,900.00
2       69,900.00
3       46,990.00
4       16,800.00
           ...
29475    5,499.00
29476    7,300.00
29477   29,900.00
29478    4,440.00
29479         NaN
Name: price, Length: 29480, dtype: float64

In [39]:
df0['price'].apply(type).value_counts()

<class 'float'>    29480
Name: price, dtype: int64

In [41]:
# 850 개의 Null 벨류가 있다.

display(df0.price.isnull().sum())
display(df0.shape)

850

(29480, 46)

In [42]:
# !!! 중요 !!! 모든 컬럼이 Nan 벨류인 것을 제거한다.

df0.dropna(how='all', inplace=True)

In [43]:
# 잘 적용이 되었는지 확인하기 
display(df0.price.isnull().sum())
display(df0.shape)

# 29480 - 28630 = 850

0

(28630, 46)

In [44]:
df0['price'].describe()

count      28,630.00
mean       23,555.20
std        25,953.71
min           490.00
25%        11,990.00
50%        17,980.00
75%        27,990.00
max     1,346,900.00
Name: price, dtype: float64

# location | columns

In [67]:
first_looking("location")

column name    :  location
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  8181
--------------------------------
Av. Laboral, 10,  28021 MADRID, ES                          306
Luckenwalder Berg 5,  14913 Jüterbog, DE                    170
Ctra. del Mig, 96,,  08097 L'Hospitalet de Llobregat, ES    146
9 boulevard Jules Ferry,  75011 Paris, FR                   142
Neuenhofstr. 77,  52078 Aachen, DE                          135
                                                           ...
2727CT ZOETERMEER, NL                                         1
Rosendaalsestraat 437-439,  6824 CK ARNHEM, NL                1
5751VH DEURNE, NL                                             1
00148 roma, IT                                                1
Sur rendez-vous,  5060 Sambreville, BE                        1
Name: location, Length: 8181, dtype: int64

### Location feature will be kept for finding the answers of some analytical questions in this analysis for now, but in machine learning modelling.

## body_type | column

In [70]:
first_looking('body_type')

column name    :  body_type
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  6
shape_of_df    :  (28630, 45)
--------------------------------
[\n, Station wagon, \n]       5448
[\n, Off-Road/Pick-up, \n]    5415
[\n, Compact, \n]             5387
[\n, Sedan, \n]               5043
[\n, Coupe, \n]               4009
[\n, Convertible, \n]         3328
Name: body_type, dtype: int64

In [71]:
df0['body_type'] = picker_explode('body_type')

In [72]:
df0['body_type']

0        Compact
1        Compact
2        Compact
3        Compact
4        Compact
          ...
29474      Sedan
29475      Sedan
29476      Sedan
29477      Sedan
29478      Sedan
Name: body_type, Length: 28630, dtype: object

In [73]:
df0["body_type"].value_counts(dropna=False)

Station wagon       5448
Off-Road/Pick-up    5415
Compact             5387
Sedan               5043
Coupe               4009
Convertible         3328
Name: body_type, dtype: int64

## type | column

In [74]:
first_looking('type')

column name    :  type
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  4
shape_of_df    :  (28630, 45)
--------------------------------
[\n, Used, \n]              25251
[\n, Demonstration, \n]      1433
[\n, Pre-registered, \n]     1377
[\n, Employee's car, \n]      569
Name: type, dtype: int64

In [75]:
df0.type = picker_explode('type')
df0.type

0                  Used
1        Pre-registered
2                  Used
3                  Used
4                  Used
              ...
29474              Used
29475              Used
29476              Used
29477              Used
29478              Used
Name: type, Length: 28630, dtype: object

In [76]:
df0.type.value_counts(dropna=False)

Used              25251
Demonstration      1433
Pre-registered     1377
Employee's car      569
Name: type, dtype: int64

## doors | columns

In [77]:
first_looking('doors')

column name    :  doors
--------------------------------
per_of_nulls   :  % 1.25
num_of_nulls   :  359
num_of_uniques :  7
shape_of_df    :  (28630, 45)
--------------------------------
[\n, 5, \n]    17481
[\n, 2, \n]     5523
[\n, 4, \n]     3001
[\n, 3, \n]     2259
NaN              359
[\n, 6, \n]        5
[\n, 1, \n]        2
Name: doors, dtype: int64

In [ ]:
# df0.doors = df0.doors.apply(lambda x: x[0].split(',')[1] if type(x)==list  else np.nan).astype('float')

In [78]:
df0['doors'] = df0['doors'].explode().str.strip("\n, ")
df0['doors'] = pd.to_numeric(df0['doors'])
df0['doors']

0       5.00
1       4.00
2       5.00
3       5.00
4       5.00
        ...
29474   4.00
29475   4.00
29476   3.00
29477   4.00
29478   4.00
Name: doors, Length: 28630, dtype: float64

In [80]:
df0.doors.value_counts(dropna=False)

5.00    17481
2.00     5523
4.00     3001
3.00     2259
NaN       359
6.00        5
1.00        2
Name: doors, dtype: int64

## country_version | column

In [81]:
first_looking('country_version')

column name    :  country_version
--------------------------------
per_of_nulls   :  % 41.01
num_of_nulls   :  11741
num_of_uniques :  26
shape_of_df    :  (28630, 45)
--------------------------------
NaN                   11741
[\n, Germany, \n]      7939
[\n, Spain, \n]        6376
[\n, Italy, \n]         679
[\n, Belgium, \n]       641
                      ...
[\n, Croatia, \n]         3
[\n, Bulgaria, \n]        1
[\n, Malta, \n]           1
[\n, Canada, \n]          1
[\n, Mexico, \n]          1
Name: country_version, Length: 26, dtype: int64

In [82]:
df0.country_version = picker('country_version')

In [ ]:
# df0["country_version"] = df0["country_version"].apply(lambda item: item[0] if type(item) == list else item)\
#                                              .str.strip("\n, ")
# df0["country_version"]

In [83]:
#df0.country_version = picker_explode('country_version')
df0["country_version"].value_counts(dropna=False)

NaN          11741
 Germany      7939
 Spain        6376
 Italy         679
 Belgium       641
             ...
 Croatia         3
 Bulgaria        1
 Malta           1
 Canada          1
 Mexico          1
Name: country_version, Length: 26, dtype: int64

In [84]:
# location column 에서 나라를 뽑아쓸 것. 따라서 제거.

In [85]:
drop_columns('country_version')

In [86]:
df0.shape

(28630, 44)

## offer_number | column (need to clean)

In [87]:
first_looking('offer_number')

column name    :  offer_number
--------------------------------
per_of_nulls   :  % 19.32
num_of_nulls   :  5530
num_of_uniques :  20946
shape_of_df    :  (28630, 44)
--------------------------------
NaN                                5530
[\n, 1, \n]                          28
[\n, L-Vorlauf 2023, \n]             10
[\n, 30, \n]                          9
[\n, 20, \n]                          9
                                   ...
[\n, ggp-EP-880-ZS, \n]               1
[\n, 7475319, \n]                     1
[\n, abci-EZ-260-PS_130291, \n]       1
[\n, 7407611, \n]                     1
[\n, 43-JR-LR, \n]                    1
Name: offer_number, Length: 20946, dtype: int64

In [88]:
df0.offer_number = picker_explode('offer_number')
df0.offer_number

0         7468157
1         7054863
2         7410454
3         7464503
4         7127931
           ...
29474     7449968
29475    09-PF-XS
29476         NaN
29477        2791
29478    43-JR-LR
Name: offer_number, Length: 28630, dtype: object

In [89]:
drop_columns('offer_number')

In [90]:
df0.shape

(28630, 43)

## warranty | column

In [91]:
first_looking('warranty')

column name    :  warranty
--------------------------------
per_of_nulls   :  % 44.87
num_of_nulls   :  12846
num_of_uniques :  66
shape_of_df    :  (28630, 43)
--------------------------------
NaN                     12846
[\n, 12 months, \n]      9545
[\n, Yes, \n]            2319
[\n, 24 months, \n]      1515
[\n, 60 months, \n]       968
                        ...
[\n, 55 months, \n]         1
[\n, 99 months, \n]         1
[\n, 122 months, \n]        1
[\n, 44 months, \n]         1
[\n, 4 months, \n]          1
Name: warranty, Length: 66, dtype: int64

In [92]:
df0.warranty = picker_explode('warranty').str.replace('months', '')

In [94]:
df0["warranty"] = df0.warranty.str.extract('(\d{1,4})').astype("float") # str.extract('(\d+)')
df0["warranty"]

0       24.00
1       24.00
2       12.00
3       12.00
4       12.00
         ...
29474   12.00
29475     NaN
29476   13.00
29477   12.00
29478     NaN
Name: warranty, Length: 28630, dtype: float64

In [95]:
df0.warranty.value_counts(dropna=False)

NaN       15165
12.00      9545
24.00      1515
60.00       968
6.00        398
          ...
55.00         1
99.00         1
122.00        1
44.00         1
4.00          1
Name: warranty, Length: 65, dtype: int64

In [93]:
## what should I do with Yes/NaN value? : Part2

## mileage | column

In [96]:
first_looking('mileage')

column name    :  mileage
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  1
num_of_uniques :  14184
shape_of_df    :  (28630, 43)
--------------------------------
10 km         586
1 km          172
50 km         133
100 km        119
5,000 km      118
             ...
141,589 km      1
59,821 km       1
123,500 km      1
29,781 km       1
230,047 km      1
Name: mileage, Length: 14184, dtype: int64

In [97]:
df0.mileage = df0.mileage.str.replace(' km', '').str.replace(',','').astype('float')

In [99]:
df0.mileage.value_counts(dropna=False)

10.00         586
1.00          172
50.00         133
100.00        119
5,000.00      118
             ...
141,589.00      1
59,821.00       1
123,500.00      1
29,781.00       1
230,047.00      1
Name: mileage, Length: 14184, dtype: int64

## first_registration | column

In [100]:
first_looking('first_registration')

column name    :  first_registration
--------------------------------
per_of_nulls   :  % 0.01
num_of_nulls   :  2
num_of_uniques :  656
shape_of_df    :  (28630, 43)
--------------------------------
08/2022    454
06/2022    428
05/2019    420
06/2019    418
07/2019    416
          ...
06/1967      1
06/1980      1
09/1970      1
06/1963      1
10/1979      1
Name: first_registration, Length: 656, dtype: int64

In [101]:
df0['first_registration'].str.extract('.*(\d{4})', expand=False)

0        2016
1        2022
2        2020
3        2020
4        2015
         ...
29474    2019
29475    2004
29476    2011
29477    2017
29478    2002
Name: first_registration, Length: 28630, dtype: object

In [104]:
# df0['first_registration'].map(lambda x: str(x)[-4:])
# df0.apply(lambda x: str(x['first_registration'])[-4:], axis=1)
# [x.strip()[-4:] for x in df['first_registration'].astype(str)]
# df0['first_registration'].astype(str).str.findall("(\w{4})").str.join("")
# df0['first_registration'].astype(str).str.extract("(\w{4})")
# df0['first_registration'].str.extract('.*(\d{4})', expand=False)
# df0['first_registration'].get(1).extract("(\w{4})")

df0['first_registration'].str[-4:]

0        2016
1        2022
2        2020
3        2020
4        2015
         ...
29474    2019
29475    2004
29476    2011
29477    2017
29478    2002
Name: first_registration, Length: 28630, dtype: object

In [105]:
df0['first_registration'] = df0['first_registration'].str[-4:].astype('float')
df0['first_registration']

0       2,016.00
1       2,022.00
2       2,020.00
3       2,020.00
4       2,015.00
          ...
29474   2,019.00
29475   2,004.00
29476   2,011.00
29477   2,017.00
29478   2,002.00
Name: first_registration, Length: 28630, dtype: float64

In [106]:
df0["first_registration"].value_counts(dropna=False)

2,019.00    3667
2,018.00    3492
2,022.00    3086
2,021.00    2870
2,020.00    2473
            ...
2,023.00       1
1,929.00       1
1,950.00       1
1,928.00       1
2,202.00       1
Name: first_registration, Length: 84, dtype: int64

## production_date | column

In [107]:
first_looking("production_date")

column name    :  production_date
--------------------------------
per_of_nulls   :  % 79.36
num_of_nulls   :  22722
num_of_uniques :  50
shape_of_df    :  (28630, 43)
--------------------------------
NaN         22722
2,019.00     1179
2,021.00      980
2,022.00      894
2,020.00      763
            ...
1,988.00        1
1,962.00        1
1,981.00        1
1,985.00        1
1,976.00        1
Name: production_date, Length: 50, dtype: int64

**Let's check the compatibility of the values in the ``first_registration`` with the ones in the ``production_date`` column:**

In [109]:
df0[(df0["first_registration"].notnull()) &\
   (df0["production_date"].notnull()) &\
   (df0["first_registration"]!=df0["production_date"])]\
    [["first_registration", "production_date"]]

       first_registration  production_date
23               2,019.00         2,018.00
30               2,020.00         2,018.00
31               2,020.00         2,019.00
470              2,022.00         2,021.00
472              2,019.00         2,016.00
...                   ...              ...
29350            2,019.00         2,017.00
29380            2,022.00         2,021.00
29414            2,022.00         2,021.00
29426            2,020.00         2,019.00
29436            2,022.00         2,021.00

[841 rows x 2 columns]

## Feature Engineering for "Age" Column

### ⚠️ Why do we need a new feature named "age"❓

Car age is perhaps the biggest factor in deciding the price of a second-hand car. Most probably new cars in the world lose their value fairly quickly in the initial years of usage. Unless your car is a prized vintage, you will realize that the relation between the car price and its age are inversely proportional.

Unless it is a vintage, the older the car, the lower the resale price. The reason is fairly simple – every car has a lifetime. And the closer it is to the end of its life, the lower the price.

<img src=https://i.ibb.co/Lh8Y4wv/assumption-autoscout.png width="900" height="100"><br>

In [110]:
# The data used for this project were scraped in 2022.

df0['age'] = 2022 - df0['first_registration']
df0['age']

0        6.00
1        0.00
2        2.00
3        2.00
4        7.00
         ...
29474    3.00
29475   18.00
29476   11.00
29477    5.00
29478   20.00
Name: age, Length: 28630, dtype: float64

In [111]:
df0.age.value_counts(dropna=False)

3.00       3667
4.00       3492
0.00       3086
1.00       2870
2.00       2473
           ...
-1.00         1
93.00         1
72.00         1
94.00         1
-180.00       1
Name: age, Length: 84, dtype: int64

In [113]:
df0.drop(["first_registration", "production_date"], axis=1, inplace=True)

In [115]:
df0.shape

(28630, 42)

## gearbox | column

In [116]:
first_looking('gearbox')

column name    :  gearbox
--------------------------------
per_of_nulls   :  % 0.87
num_of_nulls   :  248
num_of_uniques :  4
shape_of_df    :  (28630, 42)
--------------------------------
[\nManual\n]            17023
[\nAutomatic\n]         11287
NaN                       248
[\nSemi-automatic\n]       72
Name: gearbox, dtype: int64

In [117]:
df0.gearbox = df0.gearbox.explode().str.strip()

In [118]:
df0.gearbox.value_counts(dropna=False)

Manual            17023
Automatic         11287
NaN                 248
Semi-automatic       72
Name: gearbox, dtype: int64

## fuel_type | column

In [128]:
first_looking('fuel_type')

column name    :  fuel_type
--------------------------------
per_of_nulls   :  % 6.24
num_of_nulls   :  1787
num_of_uniques :  47
shape_of_df    :  (28630, 43)
--------------------------------
Gasoline                                                                                              8532
Diesel                                                                                                5911
Super 95                                                                                              3557
Diesel (Particle filter)                                                                              2816
Regular/Benzine 91                                                                                    2065
                                                                                                      ...
Super 95 / Super Plus 98 / Liquid petroleum gas (LPG)                                                    1
Domestic gas L / Super 95 / Domestic gas H                                                               1
Domestic gas H / Super E10 95 / Super Plus E10 98 / Super 95 / Super Plus 98 / Domestic gas L            1
Liquid petroleum gas (LPG) / Super E10 95 / Regular/Benzine 91 / Super 95 / Super Plus 98 / Biogas       1
Super 95 / Liquid petroleum gas (LPG)                                                                    1
Name: fuel_type, Length: 47, dtype: int64

In [129]:
df0["fuel_type"].str.split("/").value_counts(dropna=False)

[Gasoline]                                                                                                    8532
[Diesel]                                                                                                      5911
[Super 95]                                                                                                    3557
[Diesel (Particle filter)]                                                                                    2816
[Regular, Benzine 91]                                                                                         2065
                                                                                                              ...
[Super 95 ,  Super Plus 98 ,  Liquid petroleum gas (LPG)]                                                        1
[Domestic gas L ,  Super 95 ,  Domestic gas H]                                                                   1
[Domestic gas H ,  Super E10 95 ,  Super Plus E10 98 ,  Super 95 ,  Super Plus 98 ,  Domestic gas L]             1
[Liquid petroleum gas (LPG) ,  Super E10 95 ,  Regular, Benzine 91 ,  Super 95 ,  Super Plus 98 ,  Biogas]       1
[Super 95 ,  Liquid petroleum gas (LPG)]                                                                         1
Name: fuel_type, Length: 47, dtype: int64

In [131]:
df0["fuel_type"] = df0["fuel_type"].str.split("/").str[0].str.strip()
df0["fuel_type"]

0                          Diesel
1                        Electric
2                        Gasoline
3                        Gasoline
4                          Diesel
                   ...
29474                         NaN
29475                    Gasoline
29476    Diesel (Particle filter)
29477                    Gasoline
29478                    Super 95
Name: fuel_type, Length: 28630, dtype: object

In [132]:
df0["fuel_type"] = df0["fuel_type"].str.split("(").str[0].str.strip()
df0["fuel_type"]

0          Diesel
1        Electric
2        Gasoline
3        Gasoline
4          Diesel
           ...
29474         NaN
29475    Gasoline
29476      Diesel
29477    Gasoline
29478    Super 95
Name: fuel_type, Length: 28630, dtype: object

In [133]:
df0['fuel_type'].value_counts(dropna=False)

Gasoline          8728
Diesel            8727
Super 95          4097
Regular           2906
NaN               1787
                  ...
Domestic gas H      25
Domestic gas L      13
Ethanol              3
Hydrogen             3
Biogas               1
Name: fuel_type, Length: 18, dtype: int64

In [134]:
benzine = ["Gasoline", "Super 95", "Regular", "Super E10 95", "Super Plus 98", "Super Plus E10 98", "Others", "Ethanol"]
petroleum_gas = ["Liquid petroleum gas", "CNG", "LPG", "Domestic gas H", "Domestic gas L", "Biogas", "Hydrogen"]

def fueltype(x):
    if x in benzine:
        return "Benzine"
    elif x in petroleum_gas:
        return "Liquid/Natural Gas"
    else:
        return x

df0["fuel_type"] = df0["fuel_type"].apply(fueltype)

In [135]:
df0['fuel_type'].value_counts(dropna=False)

Benzine               17549
Diesel                 8727
NaN                    1787
Liquid/Natural Gas      379
Electric                188
Name: fuel_type, dtype: int64

## colour | column

In [136]:
first_looking('colour')

column name    :  colour
--------------------------------
per_of_nulls   :  % 6.02
num_of_nulls   :  1724
num_of_uniques :  15
shape_of_df    :  (28630, 43)
--------------------------------
Black     6473
Grey      5998
White     5185
Blue      3478
Red       2242
          ...
Beige      278
Yellow     230
Violet      98
Bronze      65
Gold        62
Name: colour, Length: 15, dtype: int64

In [ ]:
sns.barplot(x = df0.colour.value_counts(dropna = False).index, y = df0.colour.value_counts(dropna = False))
# plt.xticks(rotation = 45);
# for the get concept

# manufacturer_colour | column

### 📝 Some Remarks on manufacturer colour:

When a car is produced by a manufacturer, the exterior is painted in a specific color or colors that are part of the manufacturer's standard color palette. These colors are often referred to as the "factory" or "manufacturer" colors. The exact color options available for a particular make and model of car can vary depending on the year of production and the specific trim level or package.

In [137]:
first_looking("manufacturer_colour")

column name    :  manufacturer_colour
--------------------------------
per_of_nulls   :  % 23.9
num_of_nulls   :  6843
num_of_uniques :  4964
shape_of_df    :  (28630, 43)
--------------------------------
NaN                               6843
Blanco                            1235
Gris                               671
Azul                               552
Negro                              546
                                  ...
Colore esterno (snowflake whit       1
Pompeigraumetallic                   1
Cararragrau                          1
ICE WHITE (wit metallic)             1
Denim Blue metallic (blauw met       1
Name: manufacturer_colour, Length: 4964, dtype: int64

In [138]:
df0[['colour', 'manufacturer_colour']].sample(20)

       colour manufacturer_colour
14817    Blue     Lavablau - met.
25953   Black               Negro
14122    Blue                Azul
10605  Silver                 NaN
8927    Black                Nero
...       ...                 ...
9160      NaN        GRIS ARTENSE
23190   Brown        Toffee-Braun
27530   White                 NaN
12829   White          Candyweiss
7341     Grey                 NaN

[20 rows x 2 columns]

In [139]:
# colour 는 NaN but, munufacturer_colour는 Value가 있는것들.

df0[(df0["colour"].isnull()) & (df0["manufacturer_colour"].notnull())][["colour", "manufacturer_colour"]]

      colour   manufacturer_colour
1        NaN       Negro Obsidiana
24       NaN          GRIS GRAFITO
37       NaN          Plata Iridio
145      NaN         Gris Montagne
169      NaN  Bleu denim métallisé
...      ...                   ...
29434    NaN         Blanc Cristal
29439    NaN           Gris Osmium
29440    NaN   Noir Onyx Métallisé
29441    NaN           Gris Osmium
29446    NaN            DENIM BLUE

[1481 rows x 2 columns]

In [141]:
df0.shape

(28630, 43)

In [142]:
drop_columns('colour')

In [143]:
drop_columns('manufacturer_colour')

In [144]:
df0.shape

(28630, 41)

## paint | column

In [145]:
first_looking('paint')

column name    :  paint
--------------------------------
per_of_nulls   :  % 49.37
num_of_nulls   :  14135
num_of_uniques :  3
shape_of_df    :  (28630, 41)
--------------------------------
Metallic     14494
NaN          14135
Uni/basic        1
Name: paint, dtype: int64

In [146]:
df0['paint'] = df0['paint'].replace(np.nan, "Uni/basic", regex=True)
df0['paint']

0         Metallic
1        Uni/basic
2        Uni/basic
3        Uni/basic
4         Metallic
           ...
29474    Uni/basic
29475    Uni/basic
29476     Metallic
29477     Metallic
29478    Uni/basic
Name: paint, Length: 28630, dtype: object

In [147]:
df0['paint'].value_counts(dropna=False)

Metallic     14494
Uni/basic    14136
Name: paint, dtype: int64

In [148]:
drop_columns('paint')

In [149]:
df0.shape

(28630, 40)

## desc | column

In [ ]:
#first_looking('desc')
# this is just describtion.
drop_columns('desc')

## seller | column

In [151]:
first_looking('seller')

column name    :  seller
--------------------------------
per_of_nulls   :  % 0.0
num_of_nulls   :  0
num_of_uniques :  2
shape_of_df    :  (28630, 40)
--------------------------------
Dealer            26318
Private seller     2312
Name: seller, dtype: int64

## seats | column

In [152]:
first_looking('seats')

column name    :  seats
--------------------------------
per_of_nulls   :  % 10.92
num_of_nulls   :  3125
num_of_uniques :  12
shape_of_df    :  (28630, 40)
--------------------------------
[\n, 5, \n]     18308
[\n, 4, \n]      5390
NaN              3125
[\n, 2, \n]      1186
[\n, 7, \n]       488
                ...
[\n, 3, \n]        25
[\n, 6, \n]        12
[\n, 0, \n]         9
[\n, 1, \n]         7
[\n, 17, \n]        2
Name: seats, Length: 12, dtype: int64

In [153]:
df0.seats = picker('seats').astype('float')

In [154]:
df0.seats

0        NaN
1       5.00
2       5.00
3       5.00
4       5.00
        ...
29474   4.00
29475   5.00
29476   4.00
29477   5.00
29478   5.00
Name: seats, Length: 28630, dtype: float64

In [156]:
df0['seats'].value_counts(dropna=False)

# 차 문이 없거나 1개인 것들의 대한 핸들링이 필요할 것.

5.00     18308
4.00      5390
NaN       3125
2.00      1186
7.00       488
         ...
3.00        25
6.00        12
0.00         9
1.00         7
17.00        2
Name: seats, Length: 12, dtype: int64

## power | column

In [119]:
first_looking('power')

column name    :  power
--------------------------------
per_of_nulls   :  % 2.0
num_of_nulls   :  572
num_of_uniques :  352
shape_of_df    :  (28630, 42)
--------------------------------
[\n110 kW (150 hp)\n]      1992
[\n96 kW (131 hp)\n]       1356
[\n88 kW (120 hp)\n]       1182
[\n81 kW (110 hp)\n]       1166
[\n66 kW (90 hp)\n]        1110
                           ...
[\n746 kW (1,014 hp)\n]       1
[\n570 kW (775 hp)\n]         1
[\n471 kW (640 hp)\n]         1
[\n179 kW (243 hp)\n]         1
[\n26 kW (35 hp)\n]           1
Name: power, Length: 352, dtype: int64

In [120]:
df0[['power_kw', 'power_hp']] = df0["power"].apply(lambda item: item[0] if type(item) == list else item)\
                              .str.extract(r'\D*(?P<kW>\d+)\D+(?P<hp>\d+)').astype(float)

df0.head(3)

,make_model,short_description,make,model,location,price,body_type,type,doors,warranty,...,emission_class,emissions_sticker,upholstery_colour,upholstery,previous_owner,energy_efficiency_class,co_efficiency,age,power_kw,power_hp
0,Mercedes-Benz A 160,CDi,Mercedes-Benz,A 160,"P.I. EL PALMAR C/FORJA 6, 11500 PUERTO DE SAN...","16,950.00",Compact,Used,5.00,24.00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.00,NaN,NaN
1,Mercedes-Benz EQE 350,350+,Mercedes-Benz,EQE 350,"APARTADO DE CORREOS 1032, 26140 LOGROÑO, ES","80,900.00",Compact,Pre-registered,4.00,24.00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.00,215.00,292.00
2,Mercedes-Benz A 45 AMG,S 4Matic+ 8G-DCT,Mercedes-Benz,A 45 AMG,"PORT. TARRACO, MOLL DE LLEVANT, Nº 5, LOC. 6-8...","69,900.00",Compact,Used,5.00,12.00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.00,310.00,421.00

In [121]:
df0.power_kw.value_counts(dropna=False)

110.00    1992
96.00     1356
88.00     1182
81.00     1166
66.00     1110
          ...
746.00       1
570.00       1
471.00       1
179.00       1
26.00        1
Name: power_kw, Length: 352, dtype: int64

In [123]:
df0.power_hp.value_counts(dropna=False)

150.00    1992
131.00    1356
120.00    1182
110.00    1166
90.00     1110
          ...
465.00       1
412.00       1
670.00       1
506.00       1
33.00        1
Name: power_hp, Length: 348, dtype: int64

In [125]:
df0.shape

(28630, 44)

In [126]:
drop_columns('power')

In [127]:
df0.shape

(28630, 43)

## engine_size | column

In [157]:
first_looking('engine_size')

column name    :  engine_size
--------------------------------
per_of_nulls   :  % 4.9
num_of_nulls   :  1403
num_of_uniques :  468
shape_of_df    :  (28630, 40)
--------------------------------
[\n1,598 cc\n]    2099
[\n999 cc\n]      2068
[\n1,969 cc\n]    1929
NaN               1403
[\n1,461 cc\n]    1110
                  ...
[\n2,753 cc\n]       1
[\n2,495 cc\n]       1
[\n200 cc\n]         1
[\n3,224 cc\n]       1
[\n2,473 cc\n]       1
Name: engine_size, Length: 468, dtype: int64

In [ ]:
# df0.engine_size = df0.engine_size.explode().str.strip().str.strip(' cc').str.replace(',','')
# df0['engine_size'] = df0['engine_size'].astype(float)
# df0['engine_size']

In [158]:
df0['engine_size'] = df0['engine_size'].astype(str).str.strip("['\\n, cc\\n']").replace({"a", np.nan})
df0['engine_size'] = df0['engine_size'].str.replace(',', '').str.extract('(\d+)').astype("float")
df0['engine_size']

0            NaN
1           1.00
2       1,991.00
3       1,991.00
4       2,143.00
          ...
29474   1,969.00
29475   2,435.00
29476   1,560.00
29477   1,969.00
29478   2,922.00
Name: engine_size, Length: 28630, dtype: float64

In [159]:
df0['engine_size'].value_counts(dropna = False)

1,598.00    2099
999.00      2068
1,969.00    1929
NaN         1403
1,461.00    1110
            ...
2,753.00       1
2,495.00       1
200.00         1
3,224.00       1
2,473.00       1
Name: engine_size, Length: 468, dtype: int64

## gears | column

In [160]:
first_looking('gears')

column name    :  gears
--------------------------------
per_of_nulls   :  % 33.8
num_of_nulls   :  9676
num_of_uniques :  12
shape_of_df    :  (28630, 40)
--------------------------------
NaN         9676
[\n6\n]     8412
[\n5\n]     5335
[\n7\n]     1738
[\n8\n]     1690
            ...
[\n4\n]      256
[\n10\n]     112
[\n0\n]       31
[\n3\n]       24
[\n2\n]        2
Name: gears, Length: 12, dtype: int64

In [161]:
# df0['gears'] = df0['gears'].astype(str).str.extract('(\d+)').astype("float")
df0.gears = df0.gears.explode().str.strip()

In [162]:
df0['gears'] = df0['gears'].astype(float)
df0['gears']

0        NaN
1       9.00
2       8.00
3       7.00
4       7.00
        ...
29474   8.00
29475   5.00
29476   6.00
29477   8.00
29478    NaN
Name: gears, Length: 28630, dtype: float64

In [163]:
df0["gears"].value_counts(dropna=False)

NaN      9676
6.00     8412
5.00     5335
7.00     1738
8.00     1690
         ...
4.00      256
10.00     112
0.00       31
3.00       24
2.00        2
Name: gears, Length: 12, dtype: int64

## co_emissions | column

In [164]:
first_looking('co_emissions')

column name    :  co_emissions
--------------------------------
per_of_nulls   :  % 35.05
num_of_nulls   :  10036
num_of_uniques :  348
shape_of_df    :  (28630, 40)
--------------------------------
NaN                  10036
0 g/km (comb.)        1038
119 g/km (comb.)       393
124 g/km (comb.)       340
129 g/km (comb.)       319
                     ...
7 g/km (comb.)           1
80 g/km (comb.)          1
196  g/km (comb.)        1
100  g/km (comb.)        1
53 g/km (comb.)          1
Name: co_emissions, Length: 348, dtype: int64

In [ ]:
# df0.co_emissions = df0.co_emissions.str.replace(' g/km','').str.replace("(comb.)","").str.strip('()').str.strip().str.replace(',','')
# df0.co_emissions = df0.co_emissions.astype(float)
# df0.co_emissions

In [165]:
df0["co_emissions"] = df0["co_emissions"].astype(str).str.extract('(\d+)').astype("float")
df0["co_emissions"]

0          NaN
1         0.00
2          NaN
3          NaN
4          NaN
         ...
29474      NaN
29475   217.00
29476    99.00
29477   149.00
29478   251.00
Name: co_emissions, Length: 28630, dtype: float64

In [166]:
df0['co_emissions'].value_counts(dropna=False)

NaN       10036
0.00       1040
119.00      393
124.00      340
129.00      319
          ...
332.00        1
70.00         1
338.00        1
342.00        1
53.00         1
Name: co_emissions, Length: 327, dtype: int64

## drivetrain | column

In [167]:
first_looking('drivetrain')

column name    :  drivetrain
--------------------------------
per_of_nulls   :  % 41.0
num_of_nulls   :  11737
num_of_uniques :  4
shape_of_df    :  (28630, 40)
--------------------------------
[\n, Front, \n]    12066
NaN                11737
[\n, 4WD, \n]       3252
[\n, Rear, \n]      1575
Name: drivetrain, dtype: int64

In [168]:
df0.drivetrain = picker('drivetrain')
df0.drivetrain

0           NaN
1           NaN
2           4WD
3           4WD
4           4WD
          ...
29474       4WD
29475     Front
29476     Front
29477       NaN
29478     Front
Name: drivetrain, Length: 28630, dtype: object

In [169]:
df0['drivetrain'].value_counts(dropna = False)

 Front    12066
NaN       11737
 4WD       3252
 Rear      1575
Name: drivetrain, dtype: int64

## cylinders | column

In [170]:
first_looking('cylinders')

column name    :  cylinders
--------------------------------
per_of_nulls   :  % 34.15
num_of_nulls   :  9778
num_of_uniques :  13
shape_of_df    :  (28630, 40)
--------------------------------
[\n4\n]     13068
NaN          9778
[\n3\n]      3258
[\n6\n]      1013
[\n5\n]       799
            ...
[\n1\n]        21
[\n12\n]        8
[\n7\n]         6
[\n26\n]        1
[\n16\n]        1
Name: cylinders, Length: 13, dtype: int64

In [ ]:
# def picker_string(col):
    # return df0[col].explode().str.strip()

In [ ]:
# df0.cylinders = picker_string('cylinders')
# df0.cylinders = df0.cylinders.astype(float)
# df0.cylinders

In [172]:
df0["cylinders"] = df0["cylinders"].astype(str).str.extract('(\d+)').astype("float")
df0["cylinders"]

0        NaN
1        NaN
2       4.00
3       4.00
4       4.00
        ...
29474   4.00
29475   5.00
29476   4.00
29477   4.00
29478   6.00
Name: cylinders, Length: 28630, dtype: float64

In [173]:
df0.cylinders.value_counts(dropna=False)

4.00     13068
NaN       9778
3.00      3258
6.00      1013
5.00       799
         ...
1.00        21
12.00        8
7.00         6
26.00        1
16.00        1
Name: cylinders, Length: 13, dtype: int64

## fuel_consumption | column

In [174]:
first_looking('fuel_consumption')

column name    :  fuel_consumption
--------------------------------
per_of_nulls   :  % 18.32
num_of_nulls   :  5245
num_of_uniques :  3453
shape_of_df    :  (28630, 40)
--------------------------------
NaN                                                                            5245
[[0 l/100 km (comb.)]]                                                          330
[[0 l/100 km (comb.)], [0 l/100 km (city)], [0 l/100 km (country)]]             306
[[3.4 l/100 km (comb.)], [3.7 l/100 km (city)], [3.2 l/100 km (country)]]       170
[[4 l/100 km (comb.)]]                                                          149
                                                                               ...
[[14.2 l/100 km (comb.)], [21.3 l/100 km (city)], [10 l/100 km (country)]]        1
[[3.5 l/100 km (comb.)], [4.4 l/100 km (city)], [2.9 l/100 km (country)]]         1
[[4.5 l/100 km (comb.)], [6.2 l/100 km (city)], [3.5 l/100 km (country)]]         1
[[4.9 l/100 km (comb.)], [99.9 l/100 km (city)], [98 l/100 km (country)]]         1
[[10.4 l/100 km (comb.)], [15.3 l/100 km (city)], [7.6 l/100 km (country)]]       1
Name: fuel_consumption, Length: 3453, dtype: int64

In [ ]:
# pick fuel_cons_comb (Jiyeon way)
# df0['fuel_consumption'].apply(lambda x: float(x[0][0].split(' ')[0]) if type(x)==list and len(x)>0 else np.nan)
# df0['fuel_cons_comb'] = df0['fuel_consumption'].apply(lambda x: float(x[0][0].split(' ')[0]) if type(x)==list and len(x)>0 else np.nan)

In [ ]:
# pick fuel_city (Jiyeon way)
# df0.fuel_consumption.apply(lambda x: float(x[1][0].split()[0]) if type(x)==list and len(x)>1 else np.nan)
# df0['fuel_cons_city'] = df0.fuel_consumption.apply(lambda x: float(x[1][0].split()[0]) if type(x)==list and len(x)>1 else np.nan)
# df0['fuel_cons_city'].value_counts(dropna = False)

In [ ]:
# pick fuel_country
# df0.fuel_consumption.apply(lambda x: float(x[2][0].split()[0]) if type(x)==list and len(x)>2 else np.nan)
# df0['fuel_cons_country'] = df0.fuel_consumption.apply(lambda x: float(x[2][0].split()[0]) if type(x)==list and len(x)>2 else np.nan)

In [ ]:
df0["fuel_consumption"].iloc[2]

In [ ]:
df0["fuel_consumption"][2][0]

In [ ]:
df0["fuel_consumption"][2][1]

In [ ]:
df0["fuel_consumption"][2][2]

In [175]:
def cons_avg(x):
    
    if type(x)==list:
        if x[0] != []: return x[0][0]
        else: return None
  
    else:
        return None

In [177]:
def cons_city(x):
    
    if type(x)==list and len(x)==3:
        if x[1] != []: return x[1][0]
        else: return None
        
    else:
        return None

In [178]:
def cons_country(x):
    
    if type(x)==list and len(x)==3:
        if x[2] != []: return x[2][0]
        else: return None
        
    else:
        return None

In [179]:
df0['cons_avg'] = df0["fuel_consumption"].apply(cons_avg).str.extract('(\d{1,2}.\d|\d{1,3})').astype("float")
df0['cons_avg']                                        # str.extract('(\S+)')

0         NaN
1         NaN
2        8.40
3        7.30
4        4.90
         ...
29474    2.00
29475    9.10
29476    3.80
29477    6.50
29478   10.40
Name: cons_avg, Length: 28630, dtype: float64

In [180]:
df0['cons_city'] =  df0["fuel_consumption"].apply(cons_city).str.extract('(\d{1,2}.\d|\d{1,3})').astype("float") 
df0['cons_city']                                          # str.extract('(\S+)')

0         NaN
1         NaN
2       10.90
3        9.30
4        5.70
         ...
29474     NaN
29475   13.20
29476    4.30
29477    8.60
29478   15.30
Name: cons_city, Length: 28630, dtype: float64

In [182]:
df0['cons_country'] = df0["fuel_consumption"].apply(cons_country).str.extract('(\d{1,2}.\d|\d{1,3})').astype("float") 
df0['cons_country']                                            # str.extract('(\S+)'

0        NaN
1        NaN
2       5.80
3       6.10
4       4.40
        ...
29474    NaN
29475   6.70
29476   3.50
29477   5.30
29478   7.60
Name: cons_country, Length: 28630, dtype: float64

In [183]:
df0['cons_avg'].value_counts(dropna=False)

NaN      5245
5.00      831
4.90      812
4.50      690
0.00      652
         ...
16.00       1
57.00       1
61.00       1
14.50       1
44.00       1
Name: cons_avg, Length: 162, dtype: int64

In [184]:
df0['cons_city'].value_counts(dropna=False)

NaN      8530
5.80      494
6.40      485
5.30      479
5.70      464
         ...
21.50       1
50.00       1
3.10        1
79.00       1
76.10       1
Name: cons_city, Length: 196, dtype: int64

In [185]:
df0['cons_country'].value_counts(dropna=False)

NaN      8530
4.30      884
4.00      804
4.20      750
4.70      730
         ...
18.00       1
11.70       1
14.40       1
11.50       1
12.70       1
Name: cons_country, Length: 115, dtype: int64

In [186]:
df0.shape

(28630, 43)

In [187]:
drop_columns('fuel_consumption')

In [188]:
df0.shape

(28630, 42)

## comfort_&_convenience | column

In [239]:
first_looking('comfort_&_convenience')

column name    :  comfort_&_convenience
--------------------------------
per_of_nulls   :  % 11.17
num_of_nulls   :  3197
num_of_uniques :  14439
shape_of_df    :  (28630, 35)
--------------------------------
NaN                                                                                                                                                                                                                                                                                                                                                                                                              3197
[Air conditioning, Automatic climate control, Electrical side mirrors, Multi-function steering wheel, Power windows]                                                                                                                                                                                                                                                                                              244
[Air conditioning, Automatic climate control, Cruise control]                                                                                                                                                                                                                                                                                                                                                     171
[Air conditioning, Automatic climate control, Cruise control, Electrical side mirrors, Multi-function steering wheel, Power windows]                                                                                                                                                                                                                                                                              168
[Air conditioning]                                                                                                                                                                                                                                                                                                                                                                                                157
                                                                                                                                                                                                                                                                                                                                                                                                                 ...
[Armrest, Automatic climate control, 2 zones, Cruise control, Fold flat passenger seat, Hill Holder, Leather steering wheel, Light sensor, Lumbar support, Multi-function steering wheel, Navigation system, Parking assist system sensors rear, Power windows, Rain sensor, Seat heating, Split rear seats, Start-stop system]                                                                                     1
[Air conditioning, Armrest, Automatic climate control, Cruise control, Electric tailgate, Electrical side mirrors, Hill Holder, Keyless central door lock, Leather steering wheel, Light sensor, Multi-function steering wheel, Navigation system, Parking assist system sensors front, Parking assist system sensors rear, Power windows, Rain sensor, Seat heating]                                               1
[Armrest, Automatic climate control, 2 zones, Cruise control, Electrical side mirrors, Fold flat passenger seat, Hill Holder, Leather steering wheel, Light sensor, Lumbar support, Multi-function steering wheel, Navigation system, Parking assist system sensors front, Parking assist system sensors rear, Power windows, Rain sensor, Seat heating, Split rear seats, Start-stop system, Tinted windows]       1
[Armrest, Automatic climate control, 2 zones, Cruise control, Electrical side mirrors, Hill Holder, Keyless central door lock, Leather steering wheel, Light sensor, Multi-function steering wheel, Parking assist system camera, Parking assist system sensors front, Parking assist system sensors rear, Power windows, Rain sensor, Seat heating, Split rear seats, Start-stop system, Tinted windows]           1
[Air conditioning, Armrest, Cruise control, Electrical side mirrors, Leather steering wheel, Lumbar support, Multi-function steering wheel, Navigation system, Power windows, Seat heating, Tinted windows]                                                                                                                                                                                                         1
Name: comfort_&_convenience, Length: 14439, dtype: int64

In [241]:
# [item[0] if type(item) == list else item for item in df["comfort_&_convenience"]]

df0["comfort_&_convenience"] = [", ".join(item) if type(item) == list else item for item in df0["comfort_&_convenience"]]

In [242]:
df0["comfort_&_convenience"].value_counts(dropna=False).head()

NaN                                                                                                                                   3197
Air conditioning, Automatic climate control, Electrical side mirrors, Multi-function steering wheel, Power windows                     244
Air conditioning, Automatic climate control, Cruise control                                                                            171
Air conditioning, Automatic climate control, Cruise control, Electrical side mirrors, Multi-function steering wheel, Power windows     168
Air conditioning                                                                                                                       157
Name: comfort_&_convenience, dtype: int64

## entertainment_&_media | column

In [243]:
first_looking('entertainment_&_media')

column name    :  entertainment_&_media
--------------------------------
per_of_nulls   :  % 17.42
num_of_nulls   :  4986
num_of_uniques :  1945
shape_of_df    :  (28630, 35)
--------------------------------
NaN                                                                                                                                                                          4986
[Bluetooth, USB]                                                                                                                                                              753
[Bluetooth]                                                                                                                                                                   665
[On-board computer]                                                                                                                                                           662
[CD player, On-board computer, Radio]                                                                                                                                         644
                                                                                                                                                                             ...
[Android Auto, Apple CarPlay, Bluetooth, Digital cockpit, Digital radio, Induction charging for smartphones, On-board computer, Radio, Sound system, WLAN / WiFi hotspot]       1
[Bluetooth, CD player, Digital cockpit, Digital radio, Hands-free equipment, Integrated music streaming, On-board computer, Sound system, USB, WLAN / WiFi hotspot]             1
[Digital cockpit, Digital radio, On-board computer, Radio]                                                                                                                      1
[Android Auto, Apple CarPlay, Digital radio, On-board computer, Radio, Sound system, USB, WLAN / WiFi hotspot]                                                                  1
[Hands-free equipment, Integrated music streaming, On-board computer, Radio, USB]                                                                                               1
Name: entertainment_&_media, Length: 1945, dtype: int64

In [244]:
# [item[0] if type(item) == list else item for item in df["entertainment_&_media"]]

df0["entertainment_&_media"] = [", ".join(item) if type(item) == list else item for item in df0["entertainment_&_media"]]

In [245]:
df0["entertainment_&_media"].value_counts(dropna=False).head(10)

NaN                                                                                                                4986
Bluetooth, USB                                                                                                      753
Bluetooth                                                                                                           665
On-board computer                                                                                                   662
CD player, On-board computer, Radio                                                                                 644
Radio                                                                                                               425
Android Auto, Apple CarPlay, Bluetooth, Digital radio, Hands-free equipment, On-board computer, Radio, USB          414
Bluetooth, CD player, Hands-free equipment, MP3, On-board computer, Radio, USB                                      408
CD player, Radio                                                                                                    367
Android Auto, Apple CarPlay, Bluetooth, Digital radio, Hands-free equipment, MP3, On-board computer, Radio, USB     356
Name: entertainment_&_media, dtype: int64

## safety_&_security | column

In [249]:
first_looking('safety_&_security')

column name    :  safety_&_security
--------------------------------
per_of_nulls   :  % 11.23
num_of_nulls   :  3215
num_of_uniques :  12550
shape_of_df    :  (28630, 35)
--------------------------------
NaN                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            3215
[Isofix]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        380
[ABS, Central door lock, Driver-side airbag, Electronic stability control, Immobilizer, Isofix, Passenger-side airbag, Power steering, Side airbag]                                                                                                                                                                                                                                                                                                                                                                             328
[ABS, Central door lock, Driver-side airbag, Immobilizer, Isofix, Passenger-side airbag, Power steering, Side airbag, Traction control]                                                                                                                                                                                                                                                                                                                                                                                         125
[ABS, Central door lock, Driver-side airbag, Electronic stability control, Fog lights, Isofix, Power steering, Side airbag]                                                                                                                                                                                                                                                                                                                                                                                                     121
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               ...
[Daytime running lights, Emergency brake assistant, Fog lights, Isofix, LED Daytime Running Lights, Lane departure warning system, Power steering, Tire pressure monitoring system]                                                                                                                                                                                                                                                                                                                                               1
[ABS, Adaptive Cruise Control, Central door lock, Daytime running lights, Driver drowsiness detection, Driver-side airbag, Electronic stability control, Emergency brake assistant, Emergency system, Fog lights, Full-LED headlights, Glare-free high beam headlights, Immobilizer, Isofix, LED Headlights, Lane departure warning system, Passenger-side airbag, Power steering, Side airbag, Tire pressure monitoring system, Traction control]                                                                                1
[ABS, Driver-side airbag, Electronic stability control, Emergency brake assistant, Immobilizer, LED Daytime Running Lights, Passenger-side airbag, Side airbag, Tire pressure monitoring system, Traction control]                                                                                                                                                                                                                                                                                                                1
[ABS, Blind spot monitor, Central door lock, Daytime running lights, Distance warning system, Driver drowsiness detection, Driver-side airbag, Electronic stability control, Emergency system, Fog lights, Full-LED headlights, Head airbag, High beam assist, Immobilizer, Isofix, LED Daytime Running Lights, LED Headlights, Lane departure warning system, Passenger-side airbag, Power steering, Side airbag, Speed limit control system, Tire pressure monitoring system, Traction control, Traffic sign recognition]       1
[ABS, Alarm system, Central door lock, Central door lock with remote control, Driver-side airbag, Electronic stability control, Fog lights, Head airbag, Immobilizer, Power steering, Side airbag, Traction control]                                                                                                                                                                                                                                                                                                              1
Name: safety_&_security, Length: 12550, dtype: int64

In [250]:
df0['safety_&_security'] = [", ".join(item) if type(item) == list else item for item in df0['safety_&_security'] ]

In [251]:
df0["safety_&_security"].value_counts(dropna=False).head()

NaN                                                                                                                                                  3215
Isofix                                                                                                                                                380
ABS, Central door lock, Driver-side airbag, Electronic stability control, Immobilizer, Isofix, Passenger-side airbag, Power steering, Side airbag     328
ABS, Central door lock, Driver-side airbag, Immobilizer, Isofix, Passenger-side airbag, Power steering, Side airbag, Traction control                 125
ABS, Central door lock, Driver-side airbag, Electronic stability control, Fog lights, Isofix, Power steering, Side airbag                             121
Name: safety_&_security, dtype: int64

## extras | column

In [246]:
first_looking('extras')

column name    :  extras
--------------------------------
per_of_nulls   :  % 17.99
num_of_nulls   :  5150
num_of_uniques :  9361
shape_of_df    :  (28630, 35)
--------------------------------
NaN                                                                                                                                                                                                                                                                   5150
[Alloy wheels]                                                                                                                                                                                                                                                        3408
[Alloy wheels, Roof rack]                                                                                                                                                                                                                                              380
[Alloy wheels, Sport seats]                                                                                                                                                                                                                                            372
[Alloy wheels, Touch screen]                                                                                                                                                                                                                                           231
                                                                                                                                                                                                                                                                      ...
[Alloy wheels (18"), Spoiler, Summer tyres, Trailer hitch]                                                                                                                                                                                                               1
[All season tyres, Alloy wheels, Automatically dimming interior mirror, Catalytic Converter, Headlight washer system, Ski bag, Sport seats, Trailer hitch, Winter tyres]                                                                                                 1
[Alloy wheels, Automatically dimming interior mirror, Headlight washer system, Sport package, Sport seats, Summer tyres]                                                                                                                                                 1
[Alloy wheels (19"), Ambient lighting, Automatically dimming interior mirror, Catalytic Converter, E10-enabled, Emergency tyre repair kit, Headlight washer system, Spoiler, Sport package, Sport seats, Sport suspension, Summer tyres, Tuned car, Voice Control]       1
[Alloy wheels, Automatically dimming interior mirror, Ski bag, Trailer hitch]                                                                                                                                                                                            1
Name: extras, Length: 9361, dtype: int64

In [247]:
df0["extras"] = [", ".join(item) if type(item) == list else item for item in df0["extras"]]

In [248]:
df0["extras"].value_counts(dropna=False).head(10)

NaN                                                               5150
Alloy wheels                                                      3408
Alloy wheels, Roof rack                                            380
Alloy wheels, Sport seats                                          372
Alloy wheels, Touch screen                                         231
Alloy wheels, Catalytic Converter, Touch screen                    178
Roof rack                                                          160
Alloy wheels, Sport seats, Sport suspension                        157
Alloy wheels, Catalytic Converter, Touch screen, Voice Control     153
Alloy wheels, Touch screen, Voice Control                          142
Name: extras, dtype: int64

## empty_weight | column

In [189]:
first_looking('empty_weight')

column name    :  empty_weight
--------------------------------
per_of_nulls   :  % 37.97
num_of_nulls   :  10872
num_of_uniques :  1219
shape_of_df    :  (28630, 42)
--------------------------------
NaN               10872
[\n1,395 kg\n]      233
[\n1,055 kg\n]      224
[\n1,423 kg\n]      216
[\n1,165 kg\n]      200
                  ...
[\n1,877 kg\n]        1
[\n1,011 kg\n]        1
[\n1,069 kg\n]        1
[\n983 kg\n]          1
[\n1,391 kg\n]        1
Name: empty_weight, Length: 1219, dtype: int64

In [ ]:
# df0.empty_weight = picker_string('empty_weight').str.replace(" kg","").str.replace(",","")
# df0.empty_weight = df0.empty_weight.astype(float)

In [190]:
df0['empty_weight'].astype(str).str.replace(',', '').str.extract('(\d+)').astype("float")

             0
0          NaN
1          NaN
2          NaN
3          NaN
4     1,545.00
...        ...
29474 2,077.00
29475 1,357.00
29476 1,356.00
29477 1,617.00
29478 1,573.00

[28630 rows x 1 columns]

In [191]:
df0['empty_weight'] = df0['empty_weight'].astype(str).str.replace(',', '').str.extract('(\d+)').astype("float")
df0['empty_weight']

0            NaN
1            NaN
2            NaN
3            NaN
4       1,545.00
          ...
29474   2,077.00
29475   1,357.00
29476   1,356.00
29477   1,617.00
29478   1,573.00
Name: empty_weight, Length: 28630, dtype: float64

In [192]:
df0['empty_weight'].value_counts(dropna=False)

NaN         10872
1,395.00      233
1,055.00      224
1,423.00      216
1,165.00      200
            ...
1,877.00        1
1,011.00        1
1,069.00        1
983.00          1
1,391.00        1
Name: empty_weight, Length: 1219, dtype: int64

## model_code | column

In [193]:
first_looking('model_code')

column name    :  model_code
--------------------------------
per_of_nulls   :  % 70.78
num_of_nulls   :  20263
num_of_uniques :  2187
shape_of_df    :  (28630, 42)
--------------------------------
NaN                   20263
[\n, 8212/AFJ, \n]       75
[\n, 1727/AAM, \n]       64
[\n, 1349/AGI, \n]       61
[\n, 1889/ABU, \n]       55
                      ...
[\n, 7593/ANL, \n]        1
[\n, 1727/ABC, \n]        1
[\n, 4136/AEC, \n]        1
[\n, 4136/668, \n]        1
[\n, 9101/449, \n]        1
Name: model_code, Length: 2187, dtype: int64

In [194]:
df0.shape

(28630, 42)

In [195]:
drop_columns('model_code')

In [196]:
df0.shape

(28630, 41)

## general_inspection | column

In [197]:
first_looking("general_inspection")

column name    :  general_inspection
--------------------------------
per_of_nulls   :  % 57.2
num_of_nulls   :  16376
num_of_uniques :  92
shape_of_df    :  (28630, 41)
--------------------------------
NaN        16376
New         5883
05/2023      286
08/2023      280
03/2023      268
           ...
09/2017        1
08/2013        1
08/2020        1
08/2018        1
03/2021        1
Name: general_inspection, Length: 92, dtype: int64

In [198]:
df0.shape

(28630, 41)

In [200]:
drop_columns('general_inspection')

In [201]:
df0.shape

(28630, 40)

## last_service | column

In [ ]:
first_looking('last_service')

In [ ]:
df0.last_service = pd.to_datetime(df0.last_service)

## full_service_history | column

In [202]:
first_looking('full_service_history')

column name    :  full_service_history
--------------------------------
per_of_nulls   :  % 56.11
num_of_nulls   :  16065
num_of_uniques :  2
shape_of_df    :  (28630, 40)
--------------------------------
NaN    16065
Yes    12565
Name: full_service_history, dtype: int64

In [203]:
df0['full_service_history'].replace(np.nan, "No", inplace = True)

In [204]:
df0['full_service_history'].value_counts(dropna = False)

No     16065
Yes    12565
Name: full_service_history, dtype: int64

## emission_class | column

In [211]:
first_looking('emission_class')

column name    :  emission_class
--------------------------------
per_of_nulls   :  % 37.62
num_of_nulls   :  10771
num_of_uniques :  10
shape_of_df    :  (28630, 39)
--------------------------------
NaN             10771
Euro 6           6418
Euro 6d-TEMP     3399
Euro 6d          2858
Euro 5           2389
Euro 4           1743
Euro 3            523
Euro 2            217
Euro 1            172
Euro 6c           140
Name: emission_class, dtype: int64

In [212]:
Euro_6 = ["Euro 6", "Euro 6d-TEMP", "Euro 6d", "Euro 6c"]

def emissionclass(x):
    if x in Euro_6:
        return "Euro 6"
    else:
        return x

df0["emission_class"] = df0["emission_class"].apply(emissionclass)

In [213]:
df0["emission_class"].value_counts(dropna=False)

Euro 6    12815
NaN       10771
Euro 5     2389
Euro 4     1743
Euro 3      523
Euro 2      217
Euro 1      172
Name: emission_class, dtype: int64

In [214]:
df0.shape

(28630, 39)

In [215]:
drop_columns('emission_class')

In [216]:
df0.shape

(28630, 38)

## emissions_sticker | column

### 📝 Some Remarks on emission sticker: 

An emission sticker in Germany for a car in a car trade web page refers to a colored sticker that is affixed to the windshield of a vehicle to indicate its level of emissions. The sticker system was introduced in Germany to help regulate access to certain environmental zones in urban areas, which are designed to restrict access to high-polluting vehicles in order to improve air quality.

The emission sticker system is based on the Euro emissions standards, with vehicles meeting higher standards being eligible for a higher level of sticker. The highest level of sticker, known as a green sticker, is reserved for vehicles with the lowest emissions, while vehicles with higher emissions may receive a yellow or red sticker.

Since 2008, German cities can legally designate low-emission zones that only motorized vehicles with an emissions sticker are allowed to enter. This sticker is called Umweltplakette or Feinstaubplakette in German. Older and polluting vehicles are not eligible for emissions stickers and are as a result barred from entering low-emission zones.

The German emissions sticker comes in three colors: red, yellow and green. The red sticker is for the most polluting vehicles, the yellow sticker for slightly less polluting vehicles and and the green sticker for the least polluting vehicles.

<img src=https://i.ibb.co/6JdPwc7/Colors-German-Emissions-Sticker.png width="400" height="100">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:100%; text-align:center; border-radius:10px 10px;">Colors German Emissions Sticker</p>

As of 2021, vehicles with a red emissions sticker are no longer allowed to enter any low-emission zones in Germany. Red stickers are therefore no longer for sale. Vehicles with a yellow sticker are only allowed to enter the low-emission zone of Neu-Ulm in Bavaria. Unless you plan to visit Neu-Ulm, obtaining a yellow sticker is not very useful.

Vehicles with a green sticker on the other hand, can enter all low-emission zones in Germany. This green emissions sticker is the one you should obtain if you intend to visit German cities with a low-emission zone.

In [217]:
first_looking("emissions_sticker")

column name    :  emissions_sticker
--------------------------------
per_of_nulls   :  % 67.12
num_of_nulls   :  19216
num_of_uniques :  5
shape_of_df    :  (28630, 38)
--------------------------------
NaN               19216
4 (Green)          9230
1 (No sticker)      176
3 (Yellow)            6
2 (Red)               2
Name: emissions_sticker, dtype: int64

In [ ]:
# pd.set_option('display.max_rows',50)

In [ ]:
# str 만 남기기
# df0["emissions_sticker"] = df0["emissions_sticker"].astype(str).str.extract(r"([a-zA-Z]+)")

In [ ]:
# int 만 남기기
# df0['emissions_sticker'] = df0['emissions_sticker'].explode().str.split(" ").apply(lambda x: x[0] if type(x)== list else x)
# df0['emissions_sticker'] = df0['emissions_sticker'].astype(float)

In [218]:
df0.shape

(28630, 38)

In [219]:
drop_columns('emissions_sticker')

In [220]:
df0.shape

(28630, 37)

## upholstery_colour | column

In [221]:
first_looking('upholstery_colour')

column name    :  upholstery_colour
--------------------------------
per_of_nulls   :  % 49.11
num_of_nulls   :  14061
num_of_uniques :  12
shape_of_df    :  (28630, 37)
--------------------------------
NaN       14061
Black     10416
Grey       2038
Other      1003
Beige       466
          ...
White        93
Blue         82
Orange       23
Green         8
Yellow        6
Name: upholstery_colour, Length: 12, dtype: int64

In [223]:
Ordinary = ["Black", "White"]
Primary = ["Red", "Yellow", "Blue"]
Secondary = ["Green", "Orange"]
Tertiary_Intermediate = ["Brown", "Grey", "Beige"]

def coloridentifier(x):
    if x in Ordinary:
        return "Ordinary"
    if x in Primary:
        return "Primary"
    if x in Secondary:
        return "Secondary"
    if x in Tertiary_Intermediate:
        return "Tertiary"    
    else:
        return x

df0["upholstery_colour"] = df0["upholstery_colour"].apply(coloridentifier)

In [224]:
df0["upholstery_colour"].value_counts(dropna=False)

NaN          14061
Ordinary     10509
Tertiary      2779
Other         1003
Primary        247
Secondary       31
Name: upholstery_colour, dtype: int64

In [225]:
df0.shape

(28630, 37)

In [226]:
drop_columns('upholstery_colour')

In [227]:
df0.shape

(28630, 36)

## upholstery | column

In [228]:
first_looking('upholstery')

column name    :  upholstery
--------------------------------
per_of_nulls   :  % 35.0
num_of_nulls   :  10020
num_of_uniques :  7
shape_of_df    :  (28630, 36)
--------------------------------
NaN             10020
Cloth            8736
Full leather     5439
Part leather     2835
alcantara         764
Other             628
Velour            208
Name: upholstery, dtype: int64

In [ ]:
# continue at Part 2
# leather = ['Full leather','Part leather']
# fabric = ['Cloth','alcantara','Velour']
# other = ['Other']

# def upholsterytype(x):
#    if x in leather:
#         return "Leather"
#    elif x in fabric:
#        return "Fabric"
#    elif x in other:
#        return "Others"
#    else:
#        return np.nan

In [ ]:
# df0['upholstery'].apply(upholsterytype).value_counts(dropna=False)

In [ ]:
# df0['upholstery'] = df0['upholstery'].apply(upholsterytype)

## production_date | column

In [ ]:
first_looking('production_date')

In [ ]:
drop_columns('production_date')

In [ ]:
# pd.set_option('display.max_rows', 30)

## previous_owner | column

In [229]:
first_looking('previous_owner')

column name    :  previous_owner
--------------------------------
per_of_nulls   :  % 51.05
num_of_nulls   :  14615
num_of_uniques :  11734
shape_of_df    :  (28630, 36)
--------------------------------
NaN                           14615
[[50 km, 06/2022], 1]            64
[[10 km, 08/2022], 1]            59
[[10 km, 07/2022], 1]            45
[[10 km, 09/2022], 1]            38
                              ...
[[358,000 km, 10/2010], 2]        1
[[165,400 km, 09/2010], 1]        1
[[65,000 km, 10/2006], 1]         1
[[71,000 km, 04/2013], 1]         1
[[230,047 km, 07/2002], 5]        1
Name: previous_owner, Length: 11734, dtype: int64

In [230]:
df0["previous_owner"] = df0["previous_owner"].str[1]
df0["previous_owner"]

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
29474    NaN
29475    NaN
29476      1
29477    NaN
29478      5
Name: previous_owner, Length: 28630, dtype: object

In [231]:
df0["previous_owner"].value_counts(dropna=False)

NaN    14615
1       9746
2       3221
3        699
4        184
       ...
9         14
12         3
10         2
14         1
13         1
Name: previous_owner, Length: 14, dtype: int64

## energy_efficiency_class | column

In [232]:
first_looking("energy_efficiency_class")

column name    :  energy_efficiency_class
--------------------------------
per_of_nulls   :  % 72.74
num_of_nulls   :  20826
num_of_uniques :  11
shape_of_df    :  (28630, 36)
--------------------------------
NaN     20826
B        2090
A        1687
C        1133
A+       1089
        ...
A+++      375
G         309
E         271
F         147
A++        67
Name: energy_efficiency_class, Length: 11, dtype: int64

In [234]:
efficient = ["A", "A+", "A++", "A+++", "B"]
unefficient = ["C", "D", "E", "F", "G"]

def energyefficiency(x):
    if x in efficient:
        return "efficient"
    elif x in unefficient:
        return "unefficient"    
    else:
        return x

df0["energy_efficiency_class"] = df0["energy_efficiency_class"].apply(energyefficiency)

In [235]:
df0["energy_efficiency_class"].value_counts(dropna=False)

NaN            20826
efficient       5308
unefficient     2496
Name: energy_efficiency_class, dtype: int64

## non_smoker_vehicle

In [205]:
first_looking('non_smoker_vehicle')

column name    :  non_smoker_vehicle
--------------------------------
per_of_nulls   :  % 59.5
num_of_nulls   :  17036
num_of_uniques :  2
shape_of_df    :  (28630, 40)
--------------------------------
NaN    17036
Yes    11594
Name: non_smoker_vehicle, dtype: int64

In [206]:
df0['non_smoker_vehicle'].replace(np.nan, "No", inplace = True)

In [207]:
df0["non_smoker_vehicle"].value_counts(dropna=False)

No     17036
Yes    11594
Name: non_smoker_vehicle, dtype: int64

In [208]:
df0.shape

(28630, 40)

In [209]:
drop_columns('non_smoker_vehicle')

In [210]:
df0.shape

(28630, 39)

# **Now we can save our cleaned file as in csv format.**

In [254]:
display(df0.shape)
print(df0.index[0], df0.index[-1])

(28630, 35)

0 29478

In [260]:
df0 = df0.reset_index(drop=True)

display(df0.shape)
print(df0.index[0], df0.index[-1])

(28630, 35)

0 28629

In [261]:
df0.head().T

,0,1,2,3,4
make_model,Mercedes-Benz A 160,Mercedes-Benz EQE 350,Mercedes-Benz A 45 AMG,Mercedes-Benz A 35 AMG,Mercedes-Benz A 45 AMG
short_description,CDi,350+,S 4Matic+ 8G-DCT,4Matic+ 7G-DCT,200CDI BE Line 4M 7G-DCT
make,Mercedes-Benz,Mercedes-Benz,Mercedes-Benz,Mercedes-Benz,Mercedes-Benz
model,A 160,EQE 350,A 45 AMG,A 35 AMG,A 45 AMG
location,"P.I. EL PALMAR C/FORJA 6, 11500 PUERTO DE SAN...","APARTADO DE CORREOS 1032, 26140 LOGROÑO, ES","PORT. TARRACO, MOLL DE LLEVANT, Nº 5, LOC. 6-8...","Carrer de Provença, 31 Local, 8029 BARCELONA, ES","CARRIL ARAGONES 4, 30007 CASILLAS, ES"
...,...,...,...,...,...
power_kw,NaN,215.00,310.00,225.00,100.00
power_hp,NaN,292.00,421.00,306.00,136.00
cons_avg,NaN,NaN,8.40,7.30,4.90
cons_city,NaN,NaN,10.90,9.30,5.70
cons_country,NaN,NaN,5.80,6.10,4.40

In [262]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28630 entries, 0 to 28629
Data columns (total 35 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   make_model               28630 non-null  object
 1   short_description        28630 non-null  object
 2   make                     28630 non-null  object
 3   model                    28630 non-null  object
 4   location                 28630 non-null  object
 5   price                    28630 non-null  float64
 6   body_type                28630 non-null  object
 7   type                     28630 non-null  object
 8   doors                    28271 non-null  float64
 9   warranty                 13465 non-null  float64
 10  mileage                  28629 non-null  float64
 11  gearbox                  28382 non-null  object
 12  fuel_type                26843 non-null  object
 13  seller                   28630 non-null  object
 14  seats                    25505 non-null  float64
 15  engine_size              27227 non-null  float64
 16  gears                    18954 non-null  float64
 17  co_emissions             18594 non-null  float64
 18  drivetrain               16893 non-null  object
 19  cylinders                18852 non-null  float64
 20  comfort_&_convenience    25433 non-null  object
 21  entertainment_&_media    23644 non-null  object
 22  safety_&_security        25415 non-null  object
 23  extras                   23480 non-null  object
 24  empty_weight             17758 non-null  float64
 25  full_service_history     28630 non-null  object
 26  upholstery               18610 non-null  object
 27  previous_owner           14015 non-null  object
 28  energy_efficiency_class  7804 non-null   object
 29  age                      28628 non-null  float64
 30  power_kw                 28058 non-null  float64
 31  power_hp                 28058 non-null  float64
 32  cons_avg                 23385 non-null  float64
 33  cons_city                20100 non-null  float64
 34  cons_country             20100 non-null  float64
dtypes: float64(16), object(19)
memory usage: 7.6+ MB

In [263]:
df0.to_csv('cleand_scout.csv', index = False)

# PART- 2 `( Handling With Missing Vales )`

# PART- 3 `( Handling With Outliers )`

# Final Step (Checking final situation of data via graphs)

## Export dataframe to csv file (without dummy)

In [ ]:
df.to_csv("final_scout_not_dummy.csv", index=False)

# Dummy Operation

## Export dataframe to csv file (dummy)

In [ ]:
df_dummied.to_csv("final_scout_dummy.csv", index=False)